#define _CRT_SECURE_NO_WARNINGS 1


//关于数据在内存中的存储方式
//#include <stdio.h>
//int main()
//{
//	int a = 4;
//	//正数的原码，反码，补码相同
//	int b = -10;
//	//4个字节
//	//32个比特位
//	//10000000000000000000000000001010 —— 原码
//	//11111111111111111111111111110101 —— 反码
//	//11111111111111111111111111110110 —— 补码=反码+1
//
//	//正数的最高符号位是 0
//	//负数的最高符号位是 1
//
//	//当内存中的计算超出了内存中的大小，去掉最高（符号）位
//	return 0;
//}

//int main()
//{
//	//大端字节序存储
//	//把一个数据的低位字节内容，存放在高地址处
//	//           高位字节内容，存放在低地址处
//	//小端字节序存储
//	//把一个数据的低位字节内容，存放在低地址处
//	//           高位字节内容，存放在高地址处
//	int c = 0x11223344;
//	int a = 0x44332211;
//	return 0;
//}


//判断机器是小端存储还是大端存储
//int main()
//{
//	int a = 1;
//	char *p =(char*) &a;
//	if (*p == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}


//整型提升要看数据类型
//如果是无符号数，整型提升前面就是0
//如果是有符号数，整型提升前面以最高符号位按位添加 

//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//截断， 从低字节开始
//	//所以a中存放的就是11111111
//	//最后a以%d的形式打印，要发生整型提升
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001
//	//所以a=-1
//
//
//	signed char b = -1;
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111
//	//正数的原反补相同
//	//所以c=255
//	printf("%d %d %d", a, b, c);
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000 ——原码
//	//11111111111111111111111101111111 ——反码
//	//11111111111111111111111110000000 ——补码
//	//11111111111111111111111110000000
//	//10000000000000000000000010000000
//	//00000000000000000000000001111111
//	//11111111111111111111111110000000
//	printf("%u", a);//%u是以无符号的形式打印出来的
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i++)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}


//#include <string.h>
//#include <stdio.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//浮点数的存储
//#include <stdio.h>
//int main()
//{
//	float a = 5.5;
//	return 0;
//}


//5.5
//101.1
//1.011*2^2
//(-1)^0*1.011*2^2
//S=0
//M=1.011
//E=2
//0100 0000 1011 0000 0000 0000 0000 0000
// 4     0   11    0   0    0    0    0
//40 b0 00 00


#include <stdio.h>
int main()
{
	int  n = 9;
	float *pfloat = (float*)&n;
	printf("%d\n", n);
	printf("%f\n", *pfloat);
	return 0;
}

//0000 0000 0000 0000 0000 0000 0000 1001
//s=0
//e=1-127=-126
//m=000 0000 0000 0000 0000 1001
//(-1)^0 * 1.001* 2^(-126)约等于0
